# SsePointElevationBaseType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SsePointElevationBaseType Property
ParameterTypeId Class See Also
---
"Elevation Base Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SsePointElevationBaseType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SsePointElevationBaseType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SsePointElevationBaseType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace